sirfonzie/esp32c3-mtk3/sdkconfig.defaults.m5stamp_c3
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# M5StampC3 USB-C is connected through the on-board CH9102 USB-UART bridge
# to ESP32-C3 UART0, not to native USB-Serial-JTAG.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=0
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# The port cannot arm the Task-WDT: IDF initializes it in
# esp_startup_start_app() (wrapped away) and feeds it from the FreeRTOS idle
# task (which does not exist here). The INT-WDT is armed and fed by the kernel.
CONFIG_ESP_TASK_WDT_EN=n
